## Staging
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 9 to add, 3 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                  RESOURCE                                   |
|----------|-----------------------------------------------------------------------------|
| add      | `aws_iam_policy.superset_athena_read[&quot;unified_production&quot;]`                 |
|          | `aws_iam_policy.superset_athena_read[&quot;unified_staging&quot;]`                    |
|          | `aws_iam_role.superset_athena_read[&quot;unified_production&quot;]`                   |
|          | `aws_iam_role.superset_athena_read[&quot;unified_staging&quot;]`                      |
|          | `aws_iam_role_policy_attachment.superset_athena_read[&quot;unified_production&quot;]` |
|          | `aws_iam_role_policy_attachment.superset_athena_read[&quot;unified_staging&quot;]`    |
| update   | `module.celery_beat_ecs.aws_ecs_service.this`                               |
|          | `module.celery_worker_ecs.aws_ecs_service.this`                             |
|          | `module.superset_ecs.aws_ecs_service.this`                                  |
| recreate | `module.celery_beat_ecs.aws_ecs_task_definition.this`                       |
|          | `module.celery_worker_ecs.aws_ecs_task_definition.this`                     |
|          | `module.superset_ecs.aws_ecs_task_definition.this`                          |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_policy.superset_athena_read["unified_production"] will be created
  + resource "aws_iam_policy" "superset_athena_read" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "SupersetAthenaRead-unified_production"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "athena:GetDataCatalog"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:athena:ca-central-1:257394494478:datacatalog/data-lake-staging",
                          + "arn:aws:athena:ca-central-1:257394494478:datacatalog/data-lake-production",
                        ]
                      + Sid      = "AthenaDataCatalogAccess"
                    },
                  + {
                      + Action   = [
                          + "athena:StopQueryExecution",
                          + "athena:StartQueryExecution",
                          + "athena:ListWorkGroups",
                          + "athena:ListTagsForResource",
                          + "athena:ListTableMetadata",
                          + "athena:ListQueryExecutions",
                          + "athena:ListNamedQueries",
                          + "athena:ListDatabases",
                          + "athena:ListDataCatalogs",
                          + "athena:GetWorkGroup",
                          + "athena:GetTableMetadata",
                          + "athena:GetQueryResultsStream",
                          + "athena:GetQueryResults",
                          + "athena:GetQueryExecution",
                          + "athena:GetPreparedStatement",
                          + "athena:GetNamedQuery",
                          + "athena:DeletePreparedStatement",
                          + "athena:CreatePreparedStatement",
                          + "athena:BatchGetQueryExecution",
                          + "athena:BatchGetNamedQuery",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AthenaRead"
                    },
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:GetBucketLocation",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::cds-data-lake-transformed-staging/*",
                          + "arn:aws:s3:::cds-data-lake-transformed-staging",
                          + "arn:aws:s3:::cds-data-lake-transformed-production/*",
                          + "arn:aws:s3:::cds-data-lake-transformed-production",
                          + "arn:aws:s3:::cds-data-lake-curated-staging/*",
                          + "arn:aws:s3:::cds-data-lake-curated-staging",
                          + "arn:aws:s3:::cds-data-lake-curated-production/*",
                          + "arn:aws:s3:::cds-data-lake-curated-production",
                        ]
                      + Sid      = "S3AthenaSourceBucketRead"
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:GetBucketLocation",
                          + "s3:AbortMultipartUpload",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::cds-data-lake-athena-staging/*",
                          + "arn:aws:s3:::cds-data-lake-athena-staging",
                          + "arn:aws:s3:::cds-data-lake-athena-production/*",
                          + "arn:aws:s3:::cds-data-lake-athena-production",
                        ]
                      + Sid      = "S3AthenaResultBucketWrite"
                    },
                  + {
                      + Action   = [
                          + "glue:GetTables",
                          + "glue:GetTableVersions",
                          + "glue:GetTableVersion",
                          + "glue:GetTable",
                          + "glue:GetPartitions",
                          + "glue:GetPartition",
                          + "glue:GetDatabases",
                          + "glue:GetDatabase",
                          + "glue:BatchGetPartition",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:glue:ca-central-1:739275439843:table/unified_production/*",
                          + "arn:aws:glue:ca-central-1:739275439843:database/unified_production",
                          + "arn:aws:glue:ca-central-1:739275439843:catalog",
                          + "arn:aws:athena:ca-central-1:257394494478:datacatalog/data-lake-production",
                        ]
                      + Sid      = "GlueRead"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.superset_athena_read["unified_staging"] will be created
  + resource "aws_iam_policy" "superset_athena_read" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "SupersetAthenaRead-unified_staging"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "athena:GetDataCatalog"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:athena:ca-central-1:257394494478:datacatalog/data-lake-staging",
                          + "arn:aws:athena:ca-central-1:257394494478:datacatalog/data-lake-production",
                        ]
                      + Sid      = "AthenaDataCatalogAccess"
                    },
                  + {
                      + Action   = [
                          + "athena:StopQueryExecution",
                          + "athena:StartQueryExecution",
                          + "athena:ListWorkGroups",
                          + "athena:ListTagsForResource",
                          + "athena:ListTableMetadata",
                          + "athena:ListQueryExecutions",
                          + "athena:ListNamedQueries",
                          + "athena:ListDatabases",
                          + "athena:ListDataCatalogs",
                          + "athena:GetWorkGroup",
                          + "athena:GetTableMetadata",
                          + "athena:GetQueryResultsStream",
                          + "athena:GetQueryResults",
                          + "athena:GetQueryExecution",
                          + "athena:GetPreparedStatement",
                          + "athena:GetNamedQuery",
                          + "athena:DeletePreparedStatement",
                          + "athena:CreatePreparedStatement",
                          + "athena:BatchGetQueryExecution",
                          + "athena:BatchGetNamedQuery",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AthenaRead"
                    },
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:GetBucketLocation",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::cds-data-lake-transformed-staging/*",
                          + "arn:aws:s3:::cds-data-lake-transformed-staging",
                          + "arn:aws:s3:::cds-data-lake-transformed-production/*",
                          + "arn:aws:s3:::cds-data-lake-transformed-production",
                          + "arn:aws:s3:::cds-data-lake-curated-staging/*",
                          + "arn:aws:s3:::cds-data-lake-curated-staging",
                          + "arn:aws:s3:::cds-data-lake-curated-production/*",
                          + "arn:aws:s3:::cds-data-lake-curated-production",
                        ]
                      + Sid      = "S3AthenaSourceBucketRead"
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:GetBucketLocation",
                          + "s3:AbortMultipartUpload",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::cds-data-lake-athena-staging/*",
                          + "arn:aws:s3:::cds-data-lake-athena-staging",
                          + "arn:aws:s3:::cds-data-lake-athena-production/*",
                          + "arn:aws:s3:::cds-data-lake-athena-production",
                        ]
                      + Sid      = "S3AthenaResultBucketWrite"
                    },
                  + {
                      + Action   = [
                          + "glue:GetTables",
                          + "glue:GetTableVersions",
                          + "glue:GetTableVersion",
                          + "glue:GetTable",
                          + "glue:GetPartitions",
                          + "glue:GetPartition",
                          + "glue:GetDatabases",
                          + "glue:GetDatabase",
                          + "glue:BatchGetPartition",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:glue:ca-central-1:454671348950:table/unified_staging/*",
                          + "arn:aws:glue:ca-central-1:454671348950:database/unified_staging",
                          + "arn:aws:glue:ca-central-1:454671348950:catalog",
                          + "arn:aws:athena:ca-central-1:257394494478:datacatalog/data-lake-staging",
                        ]
                      + Sid      = "GlueRead"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role.superset_athena_read["unified_production"] will be created
  + resource "aws_iam_role" "superset_athena_read" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::257394494478:role/superset_ecs_task_role",
                              + "arn:aws:iam::257394494478:role/celery-worker_ecs_task_role",
                            ]
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "This role allows the Superset ECS task and Celery workers to read from the unified_production Glue database"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "SupersetAthenaRead-unified_production"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.superset_athena_read["unified_staging"] will be created
  + resource "aws_iam_role" "superset_athena_read" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::257394494478:role/superset_ecs_task_role",
                              + "arn:aws:iam::257394494478:role/celery-worker_ecs_task_role",
                            ]
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "This role allows the Superset ECS task and Celery workers to read from the unified_staging Glue database"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "SupersetAthenaRead-unified_staging"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.superset_athena_read["unified_production"] will be created
  + resource "aws_iam_role_policy_attachment" "superset_athena_read" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "SupersetAthenaRead-unified_production"
    }

  # aws_iam_role_policy_attachment.superset_athena_read["unified_staging"] will be created
  + resource "aws_iam_role_policy_attachment" "superset_athena_read" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "SupersetAthenaRead-unified_staging"
    }

  # module.celery_beat_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:257394494478:service/superset/celery-beat"
        name                               = "celery-beat"
        tags                               = {
            "CostCentre" = "cds-superset-staging"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:257394494478:task-definition/celery-beat:170" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.celery_beat_ecs.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:257394494478:task-definition/celery-beat:170" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:257394494478:task-definition/celery-beat" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "257394494478.dkr.ecr.ca-central-1.amazonaws.com/superset:sha-3c1d92067858412a30984ebe2c9e45cccd61e497" -> "257394494478.dkr.ecr.ca-central-1.amazonaws.com/superset:sha-4eb64c5c6914e6d901991044ff5aea8c400c56df"
                    name                   = "celery-beat"
                    # (12 unchanged attributes hidden)
                },
              ~ {
                  - environment      = []
                  - mountPoints      = []
                    name             = "ecs-cwagent"
                  - portMappings     = []
                  - systemControls   = []
                  - volumesFrom      = []
                    # (4 unchanged attributes hidden)
                },
              ~ {
                  - environment    = []
                    name           = "init"
                  - portMappings   = []
                  - systemControls = []
                  - volumesFrom    = []
                    # (4 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "celery-beat" -> (known after apply)
      ~ revision                 = 170 -> (known after apply)
        tags                     = {
            "CostCentre" = "cds-superset-staging"
            "Terraform"  = "true"
        }
        # (13 unchanged attributes hidden)

      - volume {
          - configure_at_launch = false -> null
          - name                = "opentelemetry-auto-instrumentation" -> null
            # (1 unchanged attribute hidden)
        }
      + volume {
          + configure_at_launch = (known after apply)
          + name                = "opentelemetry-auto-instrumentation"
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.celery_worker_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:257394494478:service/superset/celery-worker"
        name                               = "celery-worker"
        tags                               = {
            "CostCentre" = "cds-superset-staging"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:257394494478:task-definition/celery-worker:173" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.celery_worker_ecs.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:257394494478:task-definition/celery-worker:173" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:257394494478:task-definition/celery-worker" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "257394494478.dkr.ecr.ca-central-1.amazonaws.com/superset:sha-3c1d92067858412a30984ebe2c9e45cccd61e497" -> "257394494478.dkr.ecr.ca-central-1.amazonaws.com/superset:sha-9eb5d9fe135b344131f30309aed0623fff9542cd"
                    name                   = "celery-worker"
                    # (12 unchanged attributes hidden)
                },
              ~ {
                  - environment      = []
                  - mountPoints      = []
                    name             = "ecs-cwagent"
                  - portMappings     = []
                  - systemControls   = []
                  - volumesFrom      = []
                    # (4 unchanged attributes hidden)
                },
              ~ {
                  - environment    = []
                    name           = "init"
                  - portMappings   = []
                  - systemControls = []
                  - volumesFrom    = []
                    # (4 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "celery-worker" -> (known after apply)
      ~ revision                 = 173 -> (known after apply)
        tags                     = {
            "CostCentre" = "cds-superset-staging"
            "Terraform"  = "true"
        }
        # (13 unchanged attributes hidden)

      - volume {
          - configure_at_launch = false -> null
          - name                = "opentelemetry-auto-instrumentation" -> null
            # (1 unchanged attribute hidden)
        }
      + volume {
          + configure_at_launch = (known after apply)
          + name                = "opentelemetry-auto-instrumentation"
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.superset_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:257394494478:service/superset/superset"
        name                               = "superset"
        tags                               = {
            "CostCentre" = "cds-superset-staging"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:257394494478:task-definition/superset:187" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.superset_ecs.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:257394494478:task-definition/superset:187" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:257394494478:task-definition/superset" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - environment      = []
                  - mountPoints      = []
                    name             = "ecs-cwagent"
                  - portMappings     = []
                  - systemControls   = []
                  - volumesFrom      = []
                    # (4 unchanged attributes hidden)
                },
              ~ {
                  - environment    = []
                    name           = "init"
                  - portMappings   = []
                  - systemControls = []
                  - volumesFrom    = []
                    # (4 unchanged attributes hidden)
                },
              ~ {
                  ~ image                  = "257394494478.dkr.ecr.ca-central-1.amazonaws.com/superset:sha-3c1d92067858412a30984ebe2c9e45cccd61e497" -> "257394494478.dkr.ecr.ca-central-1.amazonaws.com/superset:sha-4eb64c5c6914e6d901991044ff5aea8c400c56df"
                    name                   = "superset"
                    # (12 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "superset" -> (known after apply)
      ~ revision                 = 187 -> (known after apply)
        tags                     = {
            "CostCentre" = "cds-superset-staging"
            "Terraform"  = "true"
        }
        # (13 unchanged attributes hidden)

      - volume {
          - configure_at_launch = false -> null
          - name                = "opentelemetry-auto-instrumentation" -> null
            # (1 unchanged attribute hidden)
        }
      + volume {
          + configure_at_launch = (known after apply)
          + name                = "opentelemetry-auto-instrumentation"
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 9 to add, 3 to change, 3 to destroy.

Warning: Deprecated attribute

  on .terraform/modules/athena_access_logs/athena_access_logs/locals.tf line 6, in locals:
   6:   region     = data.aws_region.current.name

The attribute "name" is deprecated. Refer to the provider documentation for
details.

(and 8 more similar warnings elsewhere)

Warning: Argument is deprecated

  with module.athena_bucket.aws_s3_bucket.this,
  on .terraform/modules/athena_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

versioning is deprecated. Use the aws_s3_bucket_versioning resource instead.

(and 6 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_data_catalog.data_lake[\"production\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_data_catalog.data_lake[\"staging\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ses_bounce_rate_high"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ses_complaint_rate_high"]
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_subnet_group.superset_cache"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.superset_send_email"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.superset_send_email"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.label_sizerestrictions_body_excluded_paths"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_cloudwatch_log_group.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_iam_policy.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_iam_role.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_ssm_parameter.sentinel_forwarder_auth"]

34 tests, 19 passed, 15 warnings, 0 failures, 0 exceptions

```

</details>
